title: Detection of Redline Malware using File and Directory Discovery Technique
description: Detects the presence of File and Directory Discovery technique in Redline Malware
references:
    - https://attack.mitre.org/techniques/T1083/
author: Fothul Karim Forhan
date: 15/04/2023
status: experimental
tags:
    - attack.t1083
    - malware
    - redlinestealer
logsource:
  product: windows
  service: sysmon
detection:
  selection1:
    EventID: 2
    TargetFilename: '*\WOW64LOG.DLL'
  selection2:
    EventID: 2
    TargetFilename: 'C:\FLTLIB.DLL'
  condition: selection1 or selection2
fields:
  - Image
  - TargetFilename
  - EventType
falsepositives:
  - Legitimate applications trying to access the files
level: high