title: Detection of Redline Malware using Native API Technique
description: Detects the use of Native API technique by Redline malware
references:
    - https://attack.mitre.org/techniques/T1106/    
author: Fothul Karim Forhan
date: 15/04/2023
status: experimental
tags:
    - attack.t1106
    - malware
    - redlinestealer
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains: "GetCommandLineA"
        TargetImageFileName|contains: "\\KERNEL32.DLL"
    selection2:
        CommandLine|contains: "GetModuleFileNameA"
        TargetImageFileName|contains: "\\KERNEL32.DLL"
    selection3:
        CommandLine|contains: "GetProcAddress()"
        TargetImageFileName|contains: "\\KERNEL32.DLL"
    condition: selection1 or selection2 or selection3 
falsepositives:
    - Some legitimate software might generate this alert
level: high